# Learn Pandas from scratch

In [4]:
# 1. Import pandas
import pandas as pd

In [5]:
pd

In [9]:
buah = pd.Series(["Apel", "Durian"])
buah

0      Apel
1    Durian
dtype: object

In [11]:
harga = pd.Series([1000,2000])
harga

0    1000
1    2000
dtype: int64

In [18]:
df = pd.DataFrame({
    "Nama Buah": buah,
    "Harga Buah": harga
})
df

  Nama Buah  Harga Buah
0      Apel        1000
1    Durian        2000

In [16]:
buah2 = pd.Series(["Rambutan", "Nanas"])
buah2

0    Rambutan
1       Nanas
dtype: object

In [15]:
harga2 = pd.Series([300, 100])
harga2

0    300
1    100
dtype: int64

In [19]:
df2 = pd.DataFrame({
    "Nama Buah": buah2,
    "Harga Buah": harga2
})
df2

  Nama Buah  Harga Buah
0  Rambutan         300
1     Nanas         100

In [22]:
#con
df3 = pd.concat([df,df2])
df3

  Nama Buah  Harga Buah
0      Apel        1000
1    Durian        2000
0  Rambutan         300
1     Nanas         100

In [ ]:
#